In [128]:
#importacion de las librerias
import pandas as pd
import numpy as np

In [129]:
df = pd.read_csv("Travel details dataset.csv", index_col=0)

In [130]:
df.head(6)

,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
Trip ID,,,,,,,,,,,,
1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
6,"Paris, France",10/5/2023,10/10/2023,5.0,Michael Brown,42.0,Male,American,Hotel,1500,Flight,800

In [131]:
# Muestra el tipo de dato de cada columna.
df.dtypes

Destination              object
Start date               object
End date                 object
Duration (days)         float64
Traveler name            object
Traveler age            float64
Traveler gender          object
Traveler nationality     object
Accommodation type       object
Accommodation cost       object
Transportation type      object
Transportation cost      object
dtype: object

In [132]:
# Cuenta y muestra el número de valores nulos por columna.
df.isnull().sum()

Destination             2
Start date              2
End date                2
Duration (days)         2
Traveler name           2
Traveler age            2
Traveler gender         2
Traveler nationality    2
Accommodation type      2
Accommodation cost      2
Transportation type     3
Transportation cost     3
dtype: int64

In [133]:
# Imputar con la mediana (para columnas numéricas)
df['Traveler age'].fillna(df['Traveler age'].median(), inplace=True)

C:\Users\hyena\AppData\Local\Temp\ipykernel_23696\1784565681.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Traveler age'].fillna(df['Traveler age'].median(), inplace=True)

In [ ]:
 #Imputar con la moda (para columnas categóricas)
df['Destination'].fillna(df['Destination'].mode()[0], inplace=True)
df['Traveler name'].fillna(df['Traveler name'].mode()[0], inplace=True)
df['Traveler gender'].fillna(df['Traveler gender'].mode()[0], inplace=True)
df['Traveler nationality'].fillna(df['Traveler nationality'].mode()[0], inplace=True)
df['Accommodation type'].fillna(df['Accommodation type'].mode()[0], inplace=True)
df['Transportation type'].fillna(df['Transportation type'].mode()[0], inplace=True)

In [135]:
#convertir Start date y End date a tipo datetime usando pd.to_datetime()

df['Start date'] = pd.to_datetime(df['Start date'], errors='coerce')
df['End date'] = pd.to_datetime(df['End date'], errors='coerce')

In [ ]:
#eliminar nulos (es uno por cada fila)
df.dropna(subset=['Start date', 'End date', 'Transportation cost'], inplace=True)

In [ ]:
 #limpiar los datos de cualquier caracter que impida la correcta conversión, como simbolos de moneda, o comas usadas como separador de miles.
df['Accommodation cost'] = pd.to_numeric(df['Accommodation cost'].str.replace('[^\d\.]', '', regex=True), errors='coerce')
df['Transportation cost'] = pd.to_numeric(df['Transportation cost'].str.replace('[^\d\.]', '', regex=True), errors='coerce')

In [138]:
df.isnull().sum()

Destination             0
Start date              0
End date                0
Duration (days)         0
Traveler name           0
Traveler age            0
Traveler gender         0
Traveler nationality    0
Accommodation type      0
Accommodation cost      0
Transportation type     0
Transportation cost     0
dtype: int64

In [139]:
# Muestra el número total de filas duplicadas.
df.duplicated().sum()

0

In [140]:
#Eliminamos duplicados 
df.drop_duplicates(inplace=True)

In [141]:
#Asegurarse que se han eliminado
df.duplicated().sum()

0

In [142]:
# Mostrar número de filas y columnas.
df.shape

(136, 12)

In [143]:
df.head()

,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
Trip ID,,,,,,,,,,,,
1,"London, UK",2023-05-01,2023-05-08,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
2,"Phuket, Thailand",2023-06-15,2023-06-20,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
3,"Bali, Indonesia",2023-07-01,2023-07-08,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
4,"New York, USA",2023-08-15,2023-08-29,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
5,"Tokyo, Japan",2023-09-10,2023-09-17,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200

In [144]:
# Convertir 'Duration (days)' y 'Traveler age' a enteros
df['Duration (days)'] = df['Duration (days)'].astype(int)
df['Traveler age'] = df['Traveler age'].astype(int)

In [145]:
# Muestra el tipo de dato de cada columna.
df.dtypes

Destination                     object
Start date              datetime64[ns]
End date                datetime64[ns]
Duration (days)                  int32
Traveler name                   object
Traveler age                     int32
Traveler gender                 object
Traveler nationality            object
Accommodation type              object
Accommodation cost               int64
Transportation type             object
Transportation cost              int64
dtype: object

In [146]:
#crear df limpio
df_limpio = df.copy()

In [147]:
#Guardar el df en un csv
df_limpio.to_csv('datos_limpios.csv', index=False)

In [148]:
df_limpio = pd.read_csv("datos_limpios.csv")

In [152]:
df_limpio.head()

,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,"London, UK",2023-05-01,2023-05-08,7,John Smith,35,Male,American,Hotel,1200,Flight,600
1,"Phuket, Thailand",2023-06-15,2023-06-20,5,Jane Doe,28,Female,Canadian,Resort,800,Flight,500
2,"Bali, Indonesia",2023-07-01,2023-07-08,7,David Lee,45,Male,Korean,Villa,1000,Flight,700
3,"New York, USA",2023-08-15,2023-08-29,14,Sarah Johnson,29,Female,British,Hotel,2000,Flight,1000
4,"Tokyo, Japan",2023-09-10,2023-09-17,7,Kim Nguyen,26,Female,Vietnamese,Airbnb,700,Train,200

In [149]:
df_limpio.dtypes

Destination             object
Start date              object
End date                object
Duration (days)          int64
Traveler name           object
Traveler age             int64
Traveler gender         object
Traveler nationality    object
Accommodation type      object
Accommodation cost       int64
Transportation type     object
Transportation cost      int64
dtype: object

In [151]:
df_limpio.isnull().sum()

Destination             0
Start date              0
End date                0
Duration (days)         0
Traveler name           0
Traveler age            0
Traveler gender         0
Traveler nationality    0
Accommodation type      0
Accommodation cost      0
Transportation type     0
Transportation cost     0
dtype: int64